public class ArrayEx {
    public static void main(String[] args){
        // 자바의 배열 문법 3가지
        // 1) 기본: 자료형 선언 후 [] (권장) or 변수 []
        int[] x = {10, 20, 30};

        // 2) 빈 배열 new 자료형[안에 들어갈 원소 개수]
        int[] y = new int[3];
            // 값 추가
        y[0] = 10;
        y[1] = 20;
        y[2] = 30;

            // 배열을 사용 할 때 자주 하는 실수
            // index 0부터 시작함 인지 -> y[3] = 10 컴파일 오류는 안남 / 실행시 오류 문법뜸
            // 없는 값 출력 -> System.out.println(y[10000) 오류는 안남


        // 3) 2,3 혼합형 / 추가 지식이 있는 후 이해 가능
        int[] k = new int[]{10, 20, 30};

        // 다차원 배열 사용
        int[][] xx = new int[3][2];
        // 3행 2열
        xx[0][0] = 10;
        xx[0][1] = 20;

        xx[1][0] = 30;
        xx[1][1] = 40;

        xx[2][0] = 50;
        xx[2][1] = 60;
        // 2, 3차원을 많이 사용

        // 다차원 배열의 동적 할당
        // 행은 건들이지 않고 열 파트부분 지정 가능 / 행은 정해졌지만 열은 지정 하지않음
        // 할 수는 있지만 가독성 떨어짐 / 실 사용 잘 안함
        int[][] yy = new int[3][];
        // 각 행에 열 지정
        yy[0] = new int [3];
        yy[1] = new int [2];
        yy[2] = new int [1];
    }
}
